[{"description":"Build a fintech web application called 'AI Collection' for B2B collections teams. Create a clean, modern fintech UI with a left sidebar navigation containing: Customers, Invoices, Tasks, and Activity sections. The Invoices section should be the primary working area. Use a professional color scheme suitable for fintech (blues, whites, subtle grays). The sidebar should highlight the active section. Include the app name 'AI Collection' with a simple logo at the top of the sidebar.","type":"feature","passes":true,"id":1},{"description":"Replace the current Invoices view with a simpler Invoice Upload screen as the default view. The screen should have: 1) A prominent upload area where users can drag-and-drop or click to upload invoice PDFs or images. 2) An 'Analyze Invoice' button that triggers AI analysis. 3) After clicking analyze, show a loading state with message 'Analyzing invoice with AI...' 4) After analysis, display extracted invoice details in a clean card: Customer Name, Invoice Number, Amount (in ₹), Due Date, and Status (Draft/Sent/Overdue/Paid). 5) A 'Save Invoice' button that saves the extracted data and creates both an Invoice and Customer record. Remove filters, search, pagination, and sorting. Keep the interface minimal and focused on the upload-to-extraction flow.","type":"feature","passes":true,"id":2},{"description":"Create the Invoice List screen (Command Center) that displays all saved invoices in a table. The table should have these columns: Customer, Amount (in ₹), Due Date, Status, and AI Suggested Action. Include some example data rows like: 'Acme Corp | ₹45,000 | Overdue | Send Email' and 'Beta Ltd | ₹12,000 | Due Tomorrow | Send Email'. Each row should be clickable to open the Invoice Detail screen. The AI Suggested Action column should show the recommended action with a small icon (like mail icon for 'Send Email'). Status column should have color-coded badges (red for Overdue, yellow for Due Tomorrow, green for Paid). Add a way to navigate between the Upload screen and the List screen - perhaps tabs at the top of the Invoices section showing 'Upload Invoice' and 'Invoice List'. Do not include filters, sorting, search, or pagination.","type":"feature","passes":true,"id":3},{"description":"Enhance the Invoice Detail screen to show: 1) Invoice summary card with customer name, invoice number, amount (₹), due date, and status badge. 2) An AI recommendation section with a message like 'This invoice is overdue. The next best action is to send a payment reminder email.' - style this as a highlighted card with an AI sparkle icon. 3) Three action buttons: 'Send Email' (primary blue), 'Simulate Customer Reply' (secondary/outline), and 'Mark as Paid' (green). 4) When clicking 'Send Email', show a modal/panel with AI-generated payment reminder email text that the user can review before 'sending'. 5) When clicking 'Simulate Customer Reply', show a notification that a task has been created. 6) When clicking 'Mark as Paid', update the status to Paid and show success feedback.","type":"feature","passes":true,"id":4},{"description":"Implement the Activity Log section in the sidebar navigation. When clicking 'Activity' in the sidebar, show a timeline view of all activities across invoices. Each activity entry should show: timestamp, action description (like 'Invoice uploaded', 'AI suggested email', 'Email sent', 'Task created', 'Payment recorded'), and the related invoice/customer name. Style it as a vertical timeline with icons for each action type. Show mock activity data demonstrating the full flow - invoice upload, AI suggestion, email sent, customer reply simulated, task created, payment recorded. Activities should be grouped by date with the most recent at the top.","type":"feature","passes":true,"id":5}]
