[{"description":"Build a fintech web application called 'AI Collection' for B2B collections teams. Create a clean, modern fintech UI with a left sidebar navigation containing: Customers, Invoices, Tasks, and Activity sections. The Invoices section should be the primary working area. Use a professional color scheme suitable for fintech (blues, whites, subtle grays). The sidebar should highlight the active section. Include the app name 'AI Collection' with a simple logo at the top of the sidebar.","type":"feature","passes":true,"id":1},{"description":"Replace the current Invoices view with a simpler Invoice Upload screen as the default view. The screen should have: 1) A prominent upload area where users can drag-and-drop or click to upload invoice PDFs or images. 2) An 'Analyze Invoice' button that triggers AI analysis. 3) After clicking analyze, show a loading state with message 'Analyzing invoice with AI...' 4) After analysis, display extracted invoice details in a clean card: Customer Name, Invoice Number, Amount (in ₹), Due Date, and Status (Draft/Sent/Overdue/Paid). 5) A 'Save Invoice' button that saves the extracted data and creates both an Invoice and Customer record. Remove filters, search, pagination, and sorting. Keep the interface minimal and focused on the upload-to-extraction flow.","type":"feature","passes":true,"id":2},{"description":"Create the Invoice List screen (Command Center) that displays all saved invoices in a table. The table should have these columns: Customer, Amount (in ₹), Due Date, Status, and AI Suggested Action. Include some example data rows like: 'Acme Corp | ₹45,000 | Overdue | Send Email' and 'Beta Ltd | ₹12,000 | Due Tomorrow | Send Email'. Each row should be clickable to open the Invoice Detail screen. The AI Suggested Action column should show the recommended action with a small icon (like mail icon for 'Send Email'). Status column should have color-coded badges (red for Overdue, yellow for Due Tomorrow, green for Paid). Add a way to navigate between the Upload screen and the List screen - perhaps tabs at the top of the Invoices section showing 'Upload Invoice' and 'Invoice List'. Do not include filters, sorting, search, or pagination.","type":"feature","passes":true,"id":3}]
